drewhirschi/daily_mirror/firmware/esp32p4/sdkconfig.defaults
# Daily Mirror ESP32-P4 defaults.

CONFIG_IDF_TARGET="esp32p4"

# --- Hosted Wi-Fi -----------------------------------------------------------
# The P4 has no radio. esp_wifi_remote forwards the Wi-Fi API over esp-hosted
# to the companion ESP32-C6 on SDIO.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y

# --- Provisioning -----------------------------------------------------------
# SoftAP now. BLE provisioning through the hosted C6 is unfinished upstream;
# when it lands, this is the only switch that changes.
CONFIG_NETWORK_PROV_SCHEME_SOFTAP=y
CONFIG_NETWORK_PROV_SCHEME_BLE=n

# --- Camera -----------------------------------------------------------------
# MIPI CSI through the P4 ISP. The ISP caps at 1920x1080, which is why the
# product ships 1080p JPEGs in v1.
CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_JPEG_VIDEO_DEVICE=y
CONFIG_CAMERA_IMX519=y

# --- Memory -----------------------------------------------------------------
# A 1080p JPEG plus the frame buffers do not fit in internal RAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- Storage ----------------------------------------------------------------
# NVS holds credentials and the device token; the SD card holds the queue.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Rust std ---------------------------------------------------------------
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=16384
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- TLS --------------------------------------------------------------------
# The claim and every upload go over HTTPS with the bundled root store.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_TLS_USING_MBEDTLS=y
